In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

In [3]:
gdp_df = pd.read_csv("../Data/gdp_percapita.csv", nrows=6868)

In [4]:
internet_df = pd.read_csv("../Data/internet_use.csv", nrows=4495)

#6. Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [5]:
gdp_df.head(7)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2019  2065.036398              NaN
1     Afghanistan  2018  2033.779002              NaN
2     Afghanistan  2017  2058.383832              NaN
3     Afghanistan  2016  2057.062164              NaN
4     Afghanistan  2015  2068.265904              NaN
5     Afghanistan  2014  2102.385234              NaN
6     Afghanistan  2013  2116.465454              NaN

#5. Using the pandas read_csv() method, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.

In [6]:
internet_df.head(7)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN
6     Afghanistan  2008  1.840000              NaN

#7. Look at the shape of each DataFrame - how many rows? How many columns?

In [7]:
gdp_df.shape

(6868, 4)

In [8]:
internet_df.shape

(4495, 4)

#8.Take a look at the datatypes for the columns in each DataFrame.

In [9]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [10]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#9.Take a look at the last 10 rows of each DataFrame in turn.

In [11]:
gdp_df.tail(-11)

     Country or Area  Year        Value  Value Footnotes
11       Afghanistan  2008  1484.114729              NaN
12       Afghanistan  2007  1460.826075              NaN
13       Afghanistan  2006  1315.789565              NaN
14       Afghanistan  2005  1286.793508              NaN
15       Afghanistan  2004  1200.278256              NaN
...              ...   ...          ...              ...
6863        Zimbabwe  1994  3263.934978              NaN
6864        Zimbabwe  1993  3033.504852              NaN
6865        Zimbabwe  1992  3054.889178              NaN
6866        Zimbabwe  1991  3426.598094              NaN
6867        Zimbabwe  1990  3324.348171              NaN

[6857 rows x 4 columns]

In [12]:
internet_df.tail(-11)

     Country or Area  Year      Value  Value Footnotes
11       Afghanistan  2003   0.087891              NaN
12       Afghanistan  2002   0.004561              NaN
13       Afghanistan  2001   0.004723              NaN
14       Afghanistan  1990   0.000000              NaN
15           Albania  2014  60.100000              NaN
...              ...   ...        ...              ...
4490        Zimbabwe  1997   0.033080              NaN
4491        Zimbabwe  1996   0.016790              NaN
4492        Zimbabwe  1995   0.007684              NaN
4493        Zimbabwe  1994   0.001739              NaN
4494        Zimbabwe  1990   0.000000              NaN

[4484 rows x 4 columns]

#10.Drop the value footnotes column from both DataFrames. Check that this worked as expected. Note for columns --spell it out..don't forget the '' b/c the names of the columns are text. If you use a number instead of string/text...the drop funtion will take it as row and you will need to changed the axis to zero(rows) instead of 1. Columns are on axis 1. - columns, zero(rows)

In [13]:
gdp_df.drop(['Value Footnotes'], axis=1)
gdp_df = gdp_df.drop(['Value Footnotes'], axis=1)

In [14]:
internet_df.drop(['Value Footnotes'], axis=1)
internet_df = internet_df.drop(['Value Footnotes'], axis=1)

#11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [16]:
gdp_df.columns = ['Country', 'Year', 'GDP_Per_Capita', ]

In [17]:
gdp_df.head()

       Country  Year  GDP_Per_Capita
0  Afghanistan  2019     2065.036398
1  Afghanistan  2018     2033.779002
2  Afghanistan  2017     2058.383832
3  Afghanistan  2016     2057.062164
4  Afghanistan  2015     2068.265904